app/Models/UsuarioModel.php

SELECT `id`, `nome`
FROM `usuarios`
WHERE `nome` LIKE '%danilo%' ESCAPE '!'
---
    public function procurar($term) {

        if ($term === null) {
            return [];
        }

        return $this->select('id, nome')
                    ->like('nome', $term)
                    ->get()
                    ->getResult();